AccumulationRegisters/РегистрМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/СкладскойУчетСервер/Ext/Module.bsl
// Функция получает учетную цену материала на конкретном складе и на конкретную дату.
// Учетная цена рассчитывается как средняя стоимость остатка:
// сумма остатка / количество остатка.
// Ключевое слово Экспорт означает, что функцию можно вызывать из других модулей.
Функция ПолучитьУчетнуюЦенуМатериала(Материал, Склад, ДатаДокумента) Экспорт

	// Проверяем, выбран ли материал.
	// Если материал не указан, цену определить невозможно, поэтому возвращаем 0.
	Если Не ЗначениеЗаполнено(Материал) Тогда
		Возврат 0;
	КонецЕсли;

	// Проверяем, выбран ли склад.
	// Остатки материалов хранятся по складам, поэтому без склада цену рассчитать нельзя.
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат 0;
	КонецЕсли;

	// Создаем новый объект запроса.
	// Через запрос будем получать остатки материала из регистра накопления.
	Запрос = Новый Запрос;

	// Текст запроса получает остаток количества и остаток суммы
	// из регистра накопления РегистрМатериалов.
	// Используется виртуальная таблица Остатки, которая показывает остатки на указанный момент времени.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|	Остатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РегистрМатериалов.Остатки(
	|		&Момент,
	|		Материал = &Материал
	|		И Склад = &Склад
	|	) КАК Остатки";

	// Передаем в запрос дату, на которую нужно получить остатки.
	// КонецДня используется, чтобы взять остатки на конец указанной даты.
	Запрос.УстановитьПараметр("Момент", КонецДня(ДатаДокумента));

	// Передаем в запрос материал, по которому ищем остаток.
	Запрос.УстановитьПараметр("Материал", Материал);

	// Передаем в запрос склад, на котором ищем остаток материала.
	Запрос.УстановитьПараметр("Склад", Склад);

	// Выполняем запрос и получаем выборку результата.
	Выборка = Запрос.Выполнить().Выбрать();

	// Переходим к первой строке результата.
	// Если остаток найден, в выборке будет строка с количеством и суммой остатка.
	Если Выборка.Следующий() Тогда
		
		// Проверяем, что количество остатка не равно нулю.
		// Это нужно, чтобы не было деления на ноль.
		Если Выборка.КоличествоОстаток <> 0 Тогда

			// Рассчитываем учетную цену материала:
			// сумма остатка делится на количество остатка.
			// Окр(..., 2) округляет результат до двух знаков после запятой.
			Возврат Окр(Выборка.СуммаОстаток / Выборка.КоличествоОстаток, 2);

		КонецЕсли;
		
	КонецЕсли;

	// Если остаток не найден или количество равно нулю,
	// возвращаем 0, так как учетную цену рассчитать нельзя.
	Возврат 0;

КонецФункции
